simpleblog/app/views/comments/_comments.html.erb

<h3>Comments</h3>
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]