simpleblog/app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Brad"], ["body", "Great profile!"], ["post_id", 2], ["created_at", "2020-02-10 14:35:01.898381"], ["updated_at", "2020-02-10 14:35:01.898381"]]
---
    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(comment_params)