simpleblog/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "This is post ONE"], ["updated_at", "2020-02-10 14:14:42.404013"], ["id", 2]]
---
    def update
        @post = Post.find(params[:id])

        if(@post.update(post_params))